      ******************************************************************
      * Author:
      * Date:
      * Purpose:
      * Tectonics: cobc
      ******************************************************************
       IDENTIFICATION DIVISION.
       PROGRAM-ID. FIZZBUZZ AS "FizzBuzz".
       DATA DIVISION.
       WORKING-STORAGE SECTION.

       LINKAGE SECTION.
       01 FIZZ-BUZZ-DATA.    COPY FIZZ-BUZZ-DATA.

       PROCEDURE DIVISION USING FIZZ-BUZZ-DATA.
       MAIN-PROCEDURE.
           MOVE NUMBER-INPUT TO CONVERTED
       GOBACK.
       END PROGRAM FIZZBUZZ.
